<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"f8010dda1538c8a5e8b40cc22c72e03d643692de444d2330c38943fbc0e13e4e","plan_job_ref":"Job Create terraform plan #5 at https://github.com/presentium/infrastructure/actions/runs/9909524350","plan_out_hash":"0cc12a1fb160bfa94b13edf27ef7dc4301d3f0614fb9b84a328f59412ffc2714","plan_hash":"33ea6f06e6a307d5fa1d8815986ce28f3b7849815e6f21dfd465680b0b0df962","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.cloudflare.cloudflare_record.docs_record will be created
+   resource "cloudflare_record" "docs_record" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "docs"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = (known after apply)
+       type            = "CNAME"
+       value           = "presentium.github.io"
+       zone_id         = "********************************"
    }

  # module.cloudflare.cloudflare_record.main_landing_record will be created
+   resource "cloudflare_record" "main_landing_record" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "@"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = (known after apply)
+       type            = "CNAME"
+       value           = "presentium.github.io"
+       zone_id         = "********************************"
    }

  # module.cloudflare.cloudflare_zone_settings_override.main-settings will be created
+   resource "cloudflare_zone_settings_override" "main-settings" {
+       id                       = (known after apply)
+       initial_settings         = (known after apply)
+       initial_settings_read_at = (known after apply)
+       readonly_settings        = (known after apply)
+       zone_id                  = "********************************"
+       zone_status              = (known after apply)
+       zone_type                = (known after apply)

+       settings {
+           always_online               = (known after apply)
+           always_use_https            = "on"
+           automatic_https_rewrites    = "on"
+           binary_ast                  = (known after apply)
+           brotli                      = (known after apply)
+           browser_cache_ttl           = (known after apply)
+           browser_check               = (known after apply)
+           cache_level                 = (known after apply)
+           challenge_ttl               = (known after apply)
+           ciphers                     = (known after apply)
+           cname_flattening            = (known after apply)
+           development_mode            = (known after apply)
+           early_hints                 = (known after apply)
+           email_obfuscation           = (known after apply)
+           filter_logs_to_cloudflare   = (known after apply)
+           fonts                       = (known after apply)
+           h2_prioritization           = (known after apply)
+           hotlink_protection          = (known after apply)
+           http2                       = (known after apply)
+           http3                       = (known after apply)
+           image_resizing              = (known after apply)
+           ip_geolocation              = (known after apply)
+           ipv6                        = (known after apply)
+           log_to_cloudflare           = (known after apply)
+           max_upload                  = (known after apply)
+           min_tls_version             = "1.1"
+           mirage                      = (known after apply)
+           opportunistic_encryption    = (known after apply)
+           opportunistic_onion         = (known after apply)
+           orange_to_orange            = (known after apply)
+           origin_error_page_pass_thru = (known after apply)
+           origin_max_http_version     = (known after apply)
+           polish                      = (known after apply)
+           prefetch_preload            = (known after apply)
+           privacy_pass                = (known after apply)
+           proxy_read_timeout          = (known after apply)
+           pseudo_ipv4                 = (known after apply)
+           response_buffering          = (known after apply)
+           rocket_loader               = (known after apply)
+           security_level              = (known after apply)
+           server_side_exclude         = (known after apply)
+           sort_query_string_for_cache = (known after apply)
+           ssl                         = "strict"
+           tls_1_2_only                = (known after apply)
+           tls_1_3                     = "on"
+           tls_client_auth             = (known after apply)
+           true_client_ip_header       = (known after apply)
+           universal_ssl               = (known after apply)
+           visitor_ip                  = (known after apply)
+           waf                         = (known after apply)
+           webp                        = (known after apply)
+           websockets                  = (known after apply)
+           zero_rtt                    = (known after apply)

+           minify (known after apply)

+           mobile_redirect (known after apply)

+           nel (known after apply)

+           security_header (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #5](https://github.com/presentium/infrastructure/actions/runs/9909524350)